/**
 * Створити об'єкт машини з наступними властивостями:
 * 
 * марка - BMW
 * модель - X3
 * потужнисть двигуна - 2500
 * тип двигуна - бензиновий
 * кількість циліндрів двигуна - 4
 * ціна - 34000
 * наявність в магазині - є
 * 
 * 
 * - вивести в консоль створений об'єкт
 * - змінити ціну на 32000
 * - вивести в консоль об'єкт
 * - відмітити, що немає в наявності
 * - вивести в консоль об'єкт
 * - видалити ціну
 * - вивести в консоль об'єкт
 * 
 * 
 */

const auto = {
    brand: 'BMW',
    model: 'X3',
   
}

 function creatauto (brand, model, age)
{
    const user = {
        firstname: firstname,
        lastname: lastname,
        age: age,
        fullname: firtname+ " "+lastname, 
    }

    return user;
}

let user1 = createUser('Rayn', '')